Documents/УстановкаЦенМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенМатериалов</Name>
			<Comment>Установка цен материалов (для расчета стоимости потолка)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПараметровПродукции</xr:Item>
				<xr:Item>InformationRegister.ЦеныМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСФотопечатьюОтличается</Name>
					<Comment>#12615</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОпределенияСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСтоимостиПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПараметрам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>Установка цен на номенклатуру</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрировытьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчитываемыеПараметрыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаЦенМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ЕстьИспользуемыеЦены = УстановкаЦенСервер.ЗаполнитьИспользуемыеВидыЦен(ЭтаФорма, Объект.ВидыЦен);
		
	//ОбновитьЭлементыФормы();
	
	УстановкаЦенСервер.ПостроитьТаблицуЦенФактур(ЭтаФорма, , Объект.Валюта);
	//УстановитьУсловноеОформление();
	ЗагрузитьТабличнуюЧасть();
	Если ЕстьИспользуемыеЦены Тогда
		Элементы.ГруппаВидыЦен.Видимость = Ложь;
		Элементы.ГруппаЦены.Видимость = Истина;	
	КонецЕсли;
	
	Элементы.ВидНоменклатуры.СписокВыбора.Очистить();
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Продукция); //#6265
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	// №12232 Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.ТиповойОтрез);
	
	УправлениеФормой();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//#13646
	// для новых документов
	ПодключитьОбработчикОжидания("РазвернутьДеревоВидовЦен", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НомерСтроки = 0;
		Для каждого СтрокаТЗ из Цены Цикл
			НомерСтроки = НомерСтроки + 1;
			Если ЭтоПотолокОтрез И НЕ ЗначениеЗаполнено(СтрокаТЗ.Фактура) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Фактура"" в строке ""%НомерСтроки%"" списка ""Таблица цен""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						Объект.Ссылка,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Цены", НомерСтроки, "Фактура"),
						,
						Отказ);
			КонецЕсли;
			Если ЭтоПродукция И ЦеныНаПродукциюПоШаблону И НЕ ЗначениеЗаполнено(СтрокаТЗ.Шаблон) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Шаблон"" в строке ""%НомерСтроки%"" списка ""Таблица цен""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						Объект.Ссылка,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Цены", НомерСтроки, "Шаблон"),
						,
						Отказ);
			КонецЕсли;
			Если ЭтоПродукция И ЦеныНаПродукциюПоНоменклатуре И НЕ ЗначениеЗаполнено(СтрокаТЗ.Номенклатура) Тогда
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Номенклатура"" в строке ""%НомерСтроки%"" списка ""Таблица цен""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстОшибки,
						Объект.Ссылка,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Цены", НомерСтроки, "Номенклатура"),
						,
						Отказ);
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВидыЦен.Очистить();
	Для Каждого ТекущаяСтрока Из ВидыЦен Цикл
		Если ТекущаяСтрока.Устанавливать Тогда
			НоваяСтрока = ТекущийОбъект.ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены = ТекущаяСтрока.ВидЦены;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.Материалы.Очистить();
	ПоместитьЦеныВТабличнуюЧасть(ТекущийОбъект.Материалы);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораШаблоновПродукции" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	//ОбновитьЭлементыФормы();
	ПереформироватьТаблицуЦен();
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	
	Если НЕ ПраваПользователей.ВидЦенДоступенПользователю(Объект.ВидЦены) Тогда
		Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	СтарыйВидНоменклатуры = Объект.ВидНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Если НЕ СтарыйВидНоменклатуры = Объект.ВидНоменклатуры Тогда
		//И (СтарыйВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция")
		//	ИЛИ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"))		
		Если Цены.Количество() > 0 Тогда	
			ТекстВопроса = "Табличная часть с ценами будет очищена. Продолжить?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВидНоменклатурыПриИзмененииФрагмент", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВидНоменклатурыПриИзмененииЗавершение();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииФрагмент(Результат, ДополнительныеПарраметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Объект.ВидНоменклатуры = СтарыйВидНоменклатуры;		
	Иначе 
		Цены.Очистить();
		ВидНоменклатурыПриИзмененииЗавершение();		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииЗавершение() 
	
	Если НЕ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		Объект.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
		Объект.СпособОпределенияСтоимости = ПредопределенноеЗначение("Перечисление.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка");
	КонецЕсли;
	
	УправлениеФормой();		
		
КонецПроцедуры

&НаКлиенте
Процедура ЦенаСФотопечатьюОтличаетсяПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Цены.Очистить();		
	ВидПродукцииПриИзмененииНаСервере();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
		Объект.СпособОпределенияСтоимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПродукции, "СпособОпределенияСтоимости");
		Если Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам Тогда
			Для каждого СтрокаТЧ из Объект.ВидПродукции.УчитываемыеПараметрыПродукции Цикл
				НоваяСтрока = Цены.Добавить();
	        	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;			
		КонецЕсли;
	Иначе	
		Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПередУдалением(Элемент, Отказ)
	
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиВидыЦен

&НаКлиенте
Процедура ПерейтиКЦенам(Команда)
	
	ЦеныВыбраны = Ложь;
	Для Каждого ВидЦены Из ВидыЦен Цикл
		Если ВидЦены.Устанавливать Тогда
			ЦеныВыбраны = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЦеныВыбраны Тогда
		
		Сообщить("Для перехода к установке цен, необходимо выбрать один или несколько видов цен");
		
	Иначе
		
		ОчиститьСообщения();
	
		Если ЦеныИзменены Тогда
			ПереформироватьТаблицуЦен();			
			ЦеныИзменены = Ложь;
		КонецЕсли;	
		
		Элементы.ГруппаВидыЦен.Видимость = Ложь;
		Элементы.ГруппаЦены.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенУстановитьВсе(Команда)
	
	//Для каждого СтрокаВидЦены из ВидыЦен Цикл
	//	Если НЕ СтрокаВидЦены.Устанавливать Тогда
	//		СтрокаВидЦены.Устанавливать = Истина;
	//		Модифицированность = Истина;
	//		ЦеныИзменены = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	
	УстановкаЦенКлиент.ДеревоВидовЦенИзменитьПризнакУстанавливать(ДеревоВидовЦен, Истина, ВидыЦен);
	Модифицированность = Истина;
	ЦеныИзменены = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенСнятьВсе(Команда)

	//Для каждого СтрокаВидЦены из ВидыЦен Цикл
	//	Если СтрокаВидЦены.Устанавливать Тогда
	//		СтрокаВидЦены.Устанавливать = Ложь;
	//		Модифицированность = Истина;
	//		ЦеныИзменены = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	
	УстановкаЦенКлиент.ДеревоВидовЦенИзменитьПризнакУстанавливать(ДеревоВидовЦен, Ложь, ВидыЦен);
	Модифицированность = Истина;
	ЦеныИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПриИзменении(Элемент)
	ЦеныИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ВидыЦен.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Запрещенный Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вам запрещено изменение данного вида цен", ,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПриИзменении(Элемент)
	ЦеныИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ДеревоВидовЦенПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПриАктивизацииСтрокиОбработчикОжидания()
	
	РезультатПроверки = УстановкаЦенКлиент.ПроверитьДоступностьСдвигаВидаЦены(ДеревоВидовЦен, Элементы.ДеревоВидовЦен);
	Элементы.ДеревоВидовЦенПереместитьВидЦеныВверх.Доступность = РезультатПроверки.Вверх;
	Элементы.ДеревоВидовЦенПереместитьВидЦеныВниз.Доступность  = РезультатПроверки.Вниз;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоВидовЦен.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Запрещенный Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вам запрещено изменение данного вида цен", ,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенУстанавливатьПриИзменении(Элемент)
	
	//#13646
	ТекущиеДанные = Элементы.ДеревоВидовЦен.ТекущиеДанные;	
	УстановкаЦенКлиент.ДеревоВидовЦенУстанавливатьПриИзменении(ДеревоВидовЦен, ТекущиеДанные, ВидыЦен);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКСпискуВидовЦен(Команда)
	
	Элементы.ГруппаВидыЦен.Видимость = Истина;
	Элементы.ГруппаЦены.Видимость = Ложь;
	
	//#13646
	ПодключитьОбработчикОжидания("РазвернутьДеревоВидовЦен", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоВидовЦен()

	УстановкаЦенКлиент.РазвернутьДерево(Элементы, ДеревоВидовЦен, "ДеревоВидовЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВидЦены(Команда)
	
	Направление = ?(Команда.Имя = "ПереместитьВидЦеныВверх", -1, 1);
		
	РезультатПроверки = УстановкаЦенКлиент.ПроверитьДоступностьСдвигаВидаЦены(ДеревоВидовЦен, Элементы.ДеревоВидовЦен, ВидыЦен, Направление);
	ЦеныИзменены = Истина;
	
	ПодключитьОбработчикОжидания("ДеревоВидовЦенПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыМатериалов

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.ЦенаСФотопечатью = ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦеныЦенаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	ИмяТекущейКолонки  = Элемент.Имя;
	ЦенаСФотопечатью = ТекущиеДанные[ИмяТекущейКолонки+"Фото"];
	Если ЦенаСФотопечатью = 0 Тогда
		ТекущиеДанные[ИмяТекущейКолонки+"Фото"] = ТекущиеДанные[ИмяТекущейКолонки];
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТабличнойЧасти = Элементы.Цены.ТекущиеДанные;
	
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТаблицыМатериалов

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	 
	ТаблицаДанныхПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Если Не ЭтоПродукция Тогда
		УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаДанныхПодбора, Цены);
	Иначе
		УстановкаЦенСервер.ОбработкаВыбораПодбораШаблонов(ТаблицаДанныхПодбора, Цены);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодобратьШаблоны(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораШаблонов(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Цены); //Объект.Материалы);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуШаблонов(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуШаблонов(ЭтаФорма, Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуШаблоновЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуШаблоновНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуШаблоновНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Цены, Объект.ВидПродукции);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиЦенами(Команда)
		
	Если Цены.Количество() = 0 Тогда
		Сообщить ("Таблица цен пустая");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьТекущимиЦенамиЗавершение",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить цены и заполнить текущими значениями?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиЦенамиЗавершение(Результат, Параметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьТекущимиЦенамиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиЦенамиНаСервере()
	
	ДатаЦены = Объект.Дата;
	Если ДатаЦены = Дата(1,1,1) Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПоместитьЦеныВТабличнуюЧасть();
	
	ПараметрыПродукции = Новый Структура;
	ПараметрыПродукции.Вставить("ВидНоменклатуры", Объект.ВидНоменклатуры);
		
	Если НЕ ЭтоПродукция Тогда
		// по фактуре
		Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
			ПараметрыПродукции.Вставить("Фактура", ТекущаяСтрока.Фактура);
			ПараметрыПродукции.Вставить("ЦветФактуры", ТекущаяСтрока.ЦветФактуры);
			
			ПараметрыПродукции.Вставить("СФотопечатью", Ложь);
			ТекущаяСтрока.Цена = ЦеныКомпании.ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, ДатаЦены, ТекущаяСтрока.ВидЦены, Объект.Валюта);

			ПараметрыПродукции.Вставить("СФотопечатью", Истина);			
			ТекущаяСтрока.Цена = ЦеныКомпании.ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, ДатаЦены, ТекущаяСтрока.ВидЦены, Объект.Валюта);
		КонецЦикла;
	Иначе
		// по шаблону
		Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл			
			ПараметрыПродукции.Вставить("Шаблон", ТекущаяСтрока.Шаблон);
			ТекущаяСтрока.Цена = ЦеныКомпании.ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, ДатаЦены, ТекущаяСтрока.ВидЦены, Объект.Валюта);
		КонецЦикла;
	КонецЕсли;	
	
	ЗагрузитьТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСправочника(Команда)
	
	Если НЕ ЭтоПродукция Тогда
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Цены);
	Иначе
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеШаблонов(ЭтаФорма, Цены);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеНаСервере(ВыбранноеЗначение);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНаСервере(ГруппаФактур)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Цены, ГруппаФактур); //Объект.Материалы, ГруппаФактур);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеШаблоновПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеШаблоновНаСервере(ВыбранноеЗначение);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеШаблоновНаСервере(ГруппаШаблонов)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Цены, Объект.ВидПродукции, ГруппаШаблонов);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуВыбораВидаЦен(ОписаниеОповещения)
	
	Если Цены.Количество() = 0 Тогда
		Сообщить ("Таблица цен пустая");
	Иначе
		СписокВидовЦен = Новый Массив;
		Для Каждого ТекущаяСтрока Из ВидыЦен Цикл
			Если ТекущаяСтрока.Устанавливать Тогда
				СписокВидовЦен.Добавить(ТекущаяСтрока.ВидЦены);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("ВидыЦен", СписокВидовЦен);
		//
		//ОткрытьФорму("Документ.УстановкаЦенМатериалов.Форма.ФормаВыборВидаЦен", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
		
		ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	СписокВидовЦен);
		ПараметрыФормы.Вставить("ВыбранныеВидыЦен",		Новый Массив);
	
		ОткрытьФорму("Справочник.ВидыЦен.Форма.ФормаПодбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
			
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЦенуПослеВыбораВидаЦены", ЭтаФорма);
	ПоказатьФормуВыбораВидаЦен(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦенуПослеВыбораВидаЦены(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ТекстВопроса = ?(НЕ ЭтоПродукция, "Установить общую цену на все фактуры и цвета?", "Установить общую цену на все шаблоны?");
		УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Цены, , , , НЕ ЭтоПродукция, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦенуСФотопечатью(Команда)
			
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЦенуСФотопечатьюПослеВыбораВидаЦены", ЭтаФорма);
	ПоказатьФормуВыбораВидаЦен(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦенуСФотопечатьюПослеВыбораВидаЦены(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Цены, , "Установить общую цену на все фактуры и цвета с фотопечатью?", Ложь, , Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьНаценкуПослеВыбораВидаЦены", ЭтаФорма);
	ПоказатьФормуВыбораВидаЦен(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценкуПослеВыбораВидаЦены(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ТекстВопроса = ?(НЕ ЭтоПродукция, "Изменить цены на процент на все фактуры и цвета?", "Изменить цены на процент на все шаблоны?");
		УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаПроцент(Цены, , Результат, ТекстВопроса);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаЗаданнуюСумму(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьНаЗаданнуюСуммуПослеВыбораВидаЦены", ЭтаФорма);
	ПоказатьФормуВыбораВидаЦен(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаЗаданнуюСуммуПослеВыбораВидаЦены(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаСумму(ЭтаФорма, Цены, , Результат, Объект.ВидНоменклатуры, Объект.ЦенаСФотопечатьюОтличается);
	КонецЕсли;

КонецПроцедуры

//++ №12920
&НаКлиенте
Процедура ОкруглитьЦены(Команда)
	
	СписокВидовЦен = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из ВидыЦен Цикл
		Если ТекущаяСтрока.Устанавливать Тогда
			СписокВидовЦен.Добавить(ТекущаяСтрока.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВидовЦен.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны виды цен");
		Возврат;
		
	ИначеЕсли СписокВидовЦен.Количество() = 1 Тогда
		ОкруглитьЦеныФрагмент(СписокВидовЦен[0].Значение);
		
	Иначе
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("ВидыЦен", СписокВидовЦен);
		ПараметрыФормыВыбора.Вставить("ПоказыватьОрганизацию", Ложь);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораВидаЦеныДляОкругления", ЭтаФорма);
		
		ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаВыборВидаЦен", ПараметрыФормыВыбора, ЭтаФорма, ,,, ОповещениеОЗакрытии);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидаЦеныДляОкругления(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ОкруглитьЦеныФрагмент(Результат.ВидЦены);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглитьЦеныФрагмент(ВидЦены)

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПравилОкругления", ЭтаФорма, ВидЦены);
	ПараметрыФормы = Новый Структура("ТипВладельца", "УстановкаЦенНоменклатуры");
	ОткрытьФорму("ОбщаяФорма.ФормаНастроекОкругления", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПравилОкругления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонкиВидаЦены = УстановкаЦенВызовСервера.ИмяКолонкиПоВидуЦены(ДополнительныеПараметры);
	ПорядокОкругления = Результат.ПорядокОкругления;
	ОкруглятьВБольшуюСторону = Результат.ОкруглятьВБольшуюСторону;

	Для Каждого СтрокаНоменклатуры из Цены Цикл
		Если ЗначениеЗаполнено(СтрокаНоменклатуры[ИмяКолонкиВидаЦены]) Тогда
			СтрокаНоменклатуры[ИмяКолонкиВидаЦены] = ОбщийМодуль.ОкруглитьЧисло(СтрокаНоменклатуры[ИмяКолонкиВидаЦены], ПорядокОкругления, ОкруглятьВБольшуюСторону);
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры
//-- №12920

//#14259
&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	Если Цены.Количество() = 0 Тогда 
		Сообщить("Таблица цен пустая, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	
	сз_ВидыЦен = Новый СписокЗначений;
	сз_ВсеВидыЦен = Новый СписокЗначений;
	сз_РазрешенныеВидыЦен = Новый СписокЗначений;	
	ЗаполнитьСпискиВидовЦен(сз_ВидыЦен, сз_ВсеВидыЦен, сз_РазрешенныеВидыЦен);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УстановкаЦенНаПродукцию",	Истина);
	ПараметрыФормы.Вставить("ВсеВидыЦен",			сз_ВсеВидыЦен);
	ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	сз_ВидыЦен);
	ПараметрыФормы.Вставить("РазрешенныеВидыЦен",	сз_РазрешенныеВидыЦен);
	 
	ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныФрагмент", ЭтотОбъект);
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаРасчетаЦен", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.КонечныйВидЦен = Неопределено
		И НЕ Результат.ПроцентНаценки = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныЗавершение", ЭтотОбъект, Результат); 
		ТекстВопроса = "Виды цен """ + СтрСоединить(Результат.КонечныйВидЦен, ", ") + """ будут перерассчитаны. Продолжить?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		РассчитатьЦеныНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЦеныНаСервере(ПараметрыРасчета)
	
	ВидИсходныхДанных = ПараметрыРасчета.ВидИсходныхДанных;
	ИсходныйВидЦен = ПараметрыРасчета.ИсходныйВидЦен; 
	ИсходныйВидЦенДокумента = ПараметрыРасчета.ИсходныйВидЦенДокумента; 
	МассивКонечныхВидовЦен = ПараметрыРасчета.КонечныйВидЦен;
	ПроцентНаценки = ПараметрыРасчета.ПроцентНаценки;	
	
	Если ЗначениеЗаполнено(ИсходныйВидЦен) Тогда
		ИмяКолонкиИсточник = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ИсходныйВидЦен);
		ИмяКолонкиИсточникФ = ИмяКолонкиИсточник + "Фото";
		
	ИначеЕсли ЗначениеЗаполнено(ИсходныйВидЦенДокумента) Тогда
		ИмяКолонкиИсточник = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ИсходныйВидЦенДокумента);
		ИмяКолонкиИсточникФ = ИмяКолонкиИсточник + "Фото";
	КонецЕсли;
	
	Для каждого КонечныйВидЦен из МассивКонечныхВидовЦен Цикл
		
		ИмяКолонкиПриемник = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(КонечныйВидЦен);
		ИмяКолонкиПриемникФ = ИмяКолонкиПриемник + "Фото";
			
		Если ВидИсходныхДанных = 3 Тогда
			//наценка на указанный вид цен документа
						
			Для Каждого ТекСтрока Из Цены Цикл
				ТекСтрока[ИмяКолонкиПриемник] = ТекСтрока[ИмяКолонкиИсточник] * (1 + ПроцентНаценки/100);
				Если ЭтоПотолокОтрез Тогда
					ТекСтрока[ИмяКолонкиПриемникФ] = ТекСтрока[ИмяКолонкиИсточникФ] * (1 + ПроцентНаценки/100);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ВидИсходныхДанных = 4 Тогда
			//наценка на указанный вид цен		
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДатаСеанса(),Объект.Дата));
			Запрос.УстановитьПараметр("ВидЦены", ИсходныйВидЦен);
			Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
			Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
			Запрос.УстановитьПараметр("ТаблицаДокумента", Цены.Выгрузить());
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаДокумента.Фактура КАК Фактура,
			|	ТаблицаДокумента.ЦветФактуры КАК ЦветФактуры,
			|	ТаблицаДокумента.Шаблон КАК Шаблон
			|ПОМЕСТИТЬ ВТ_Позиции
			|ИЗ
			|	&ТаблицаДокумента КАК ТаблицаДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЦеныСрезПоследних.Валюта КАК Валюта,
			|	ЦеныСрезПоследних.ВидЦен КАК ВидЦены,
			|	ЦеныСрезПоследних.Фактура КАК Фактура,
			|	ЦеныСрезПоследних.ЦветФактуры КАК ЦветФактуры,
			|	ЦеныСрезПоследних.Шаблон КАК Шаблон,
			|	ЦеныСрезПоследних.Цена КАК Цена,
			|	ЦеныСрезПоследних.ЦенаСФотопечатью КАК ЦенаСФотопечатью
			|ИЗ
			|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
			|			&ДатаЗапроса,
			|			ВидЦен = &ВидЦены
			|				И Валюта = &Валюта
			|				И ВидНоменклатуры = &ВидНоменклатуры
			|				И (Фактура, ЦветФактуры, Шаблон) В
			|					(ВЫБРАТЬ
			|						ВТ_Позиции.Фактура,
			|						ВТ_Позиции.ЦветФактуры,
			|						ВТ_Позиции.Шаблон
			|					ИЗ
			|						ВТ_Позиции)) КАК ЦеныСрезПоследних";
			ТаблицаИсходныхЦен = Запрос.Выполнить().Выгрузить();
			
			Для Каждого ТекСтрока Из Цены Цикл
				
				ОтборИсходные = Новый Структура;
				ОтборИсходные.Вставить("Фактура", ТекСтрока.Фактура);
				ОтборИсходные.Вставить("ЦветФактуры", ТекСтрока.ЦветФактуры);
				ОтборИсходные.Вставить("Шаблон", ТекСтрока.Шаблон);
				ТоварыИсходные = ТаблицаИсходныхЦен.НайтиСтроки(ОтборИсходные);
				
				Если ТоварыИсходные.Количество() > 0 Тогда	
					ТекСтрока[ИмяКолонкиПриемник]  = ТоварыИсходные[0].Цена * (1 + ПроцентНаценки/100);
					Если ЭтоПотолокОтрез Тогда
						ТекСтрока[ИмяКолонкиПриемникФ] = ТоварыИсходные[0].ЦенаСФотопечатью * (1 + ПроцентНаценки/100);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановкаЦенСервер.УстановитьУсловноеОформление(УсловноеОформление.Элементы);
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьТаблицуЦен()
	
	ПоместитьЦеныВТабличнуюЧасть();
	УстановкаЦенСервер.ПостроитьТаблицуЦенФактур(ЭтаФорма, , Объект.Валюта);
	ЗагрузитьТабличнуюЧасть();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличнуюЧасть()
	
	ТаблицаМатериалов = Объект.Материалы.Выгрузить();	
	
	Для Каждого ТекМатериал Из ТаблицаМатериалов Цикл
		
		Отбор = Новый Структура("Фактура, ЦветФактуры, Шаблон, ПараметрПродукции", ТекМатериал.Фактура, ТекМатериал.ЦветФактуры, ТекМатериал.Шаблон, ТекМатериал.ПараметрПродукции);	
		МассивСтрок = Цены.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			НайденнаяСтрока = МассивСтрок[0];			
		Иначе
			НайденнаяСтрока = Цены.Добавить();
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, ТекМатериал, "Фактура, ЦветФактуры, Шаблон, ПараметрПродукции");
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ТекМатериал.ВидЦены) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ТекМатериал.ВидЦены);		
		НайденнаяСтрока[ИмяКолонки] = ТекМатериал.Цена;
		НайденнаяСтрока[ИмяКолонки+"Фото"] = ТекМатериал.ЦенаСФотопечатью;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьЦеныВТабличнуюЧасть(ТабличнаяЧасть=Неопределено)
	
	Если ТабличнаяЧасть=Неопределено Тогда
		ТабличнаяЧасть = Объект.Материалы;
	КонецЕсли;	
	ТабличнаяЧасть.Очистить();	
	
	Для Каждого СтрокаЦен Из Цены Цикл
				
		Для Каждого ВидЦены Из ВидыЦен Цикл			
			Если ВидЦены.Устанавливать Тогда				
				ИмяКолонки = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ВидЦены.ВидЦены);
				ЕстьКолонкаЦены = СтрокаЦен.Свойство(ИмяКолонки);
				Если ЕстьКолонкаЦены Тогда
					Цена = СтрокаЦен[ИмяКолонки];
					ЦенаСФото = СтрокаЦен[ИмяКолонки+"Фото"];
				КонецЕсли;			
				
				НоваяСтрока = ТабличнаяЧасть.Добавить();
				НоваяСтрока.Фактура = СтрокаЦен.Фактура;
				НоваяСтрока.ЦветФактуры = СтрокаЦен.ЦветФактуры;
				НоваяСтрока.Шаблон = СтрокаЦен.Шаблон;
				НоваяСтрока.ПараметрПродукции = СтрокаЦен.ПараметрПродукции;
				НоваяСтрока.Номенклатура = СтрокаЦен.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения = СтрокаЦен.ЕдиницаИзмерения;
				НоваяСтрока.ВидЦены = ВидЦены.ВидЦены;			
				
				Если ЕстьКолонкаЦены Тогда
					НоваяСтрока.Цена = Цена;								
					НоваяСтрока.ЦенаСФотопечатью = ЦенаСФото;
				КонецЕсли;		
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.МатериалыЦена.Заголовок = "Цена, " + Объект.Валюта;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой() 
	
	ЭтоПродукция = Ложь;
	Если Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		ЭтоПродукция = Истина;
		ВидПродукцииЗаполнен = ЗначениеЗаполнено(Объект.ВидПродукции);
	КонецЕсли;
	
	ЦеныНаПродукциюПоШаблону    = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону;
	ЦеныНаПродукциюПоПараметрам = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам;
	ЦеныНаПродукциюПоНоменклатуре = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре;
	
	ЭтоПотолокОтрез = (Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок")
				       ИЛИ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"));
				  
	Элементы.ЦеныГруппаФактура.Видимость = ЭтоПотолокОтрез;
	Элементы.ЦеныГруппаЦвет.Видимость    = ЭтоПотолокОтрез;
	Элементы.ЦеныГруппаШаблон.Видимость  = ЭтоПродукция И ВидПродукцииЗаполнен И ЦеныНаПродукциюПоШаблону;
	Элементы.ЦеныГруппаПараметры.Видимость = ЭтоПродукция И ВидПродукцииЗаполнен И ЦеныНаПродукциюПоПараметрам;
	Элементы.ГруппаПараметрыПродукции.Видимость = ЭтоПродукция;
	
	Элементы.ГруппаКомандПотолки.Видимость   = ЭтоПотолокОтрез;
	Элементы.ГруппаКомандПоШаблонам.Видимость = ЭтоПродукция И ЦеныНаПродукциюПоШаблону;
	
	Элементы.ЦеныГруппаНоменклатура.Видимость = ЭтоПродукция И ВидПродукцииЗаполнен И ЦеныНаПродукциюПоНоменклатуре;
	
	//#12615	
	Элементы.ЦенаСФотопечатьюОтличается.Видимость = ЭтоПотолокОтрез;
	
	Для каждого ГруппаКолонокЦен из Элементы.Цены.ПодчиненныеЭлементы Цикл
		Если Лев(ГруппаКолонокЦен.Имя, 17) = "ГруппаЦеныВидЦены" Тогда
			Для каждого КолонкаЦена из ГруппаКолонокЦен.ПодчиненныеЭлементы Цикл
				Если Прав(КолонкаЦена.Имя, 4) = "Фото" Тогда
					КолонкаЦена.Видимость = ЭтоПотолокОтрез И Объект.ЦенаСФотопечатьюОтличается;
				Иначе
					КолонкаЦена.Заголовок = ?(ЭтоПотолокОтрез, "Цена за кв.м.", "Цена");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьСпискиВидовЦен(сз_ВидыЦен, сз_ВсеВидыЦен, сз_РазрешенныеВидыЦен)
	
	Для каждого Строка Из ВидыЦен Цикл
		сз_ВсеВидыЦен.Добавить(Строка.ВидЦены);
		Если Строка.Устанавливать тогда
			сз_видыЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
		
		Если НЕ Строка.Запрещенный И Строка.Устанавливать Тогда
			сз_РазрешенныеВидыЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	Возврат сз_ВидыЦен;
	
КонецФункции

#КонецОбласти
